#include "modulo_prime.h"


namespace KAMath {

/**************************************************************************
** Проверка, является ли число простым
**************************************************************************/
void Field_ZP::check_prime() const {
	for (size_t i = 2; i <= sqrt(ch); i++) {
		if (ch % i == 0)
			throw std::runtime_error{"Non-prime characterisitcs"};
	}
}


/**************************************************************************
** Возведение в степень
**************************************************************************/
Field_ZP pow(const Field_ZP& v, const int64_t p) {
	return (p >= 0) ? Field_ZP(v.charact(), std::pow(v.get_val(), p), true)
	 : Field_ZP(v.charact(), std::pow(v.inv().get_val(), -p), true);
}


/**************************************************************************
** Проверка на ноль
**************************************************************************/
bool is_zero(const Field_ZP& val) {
	return val.get_val() == 0;
}


/**************************************************************************
** Строковое представление числа в поле вычетов по модулю простого числа
**************************************************************************/
std::string to_string(const Field_ZP& val) {
	return std::to_string(val.get_val());
}

};

